tutorials/melting/conduction/3D_cylinder_stationary/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    north
    {
        type            omegaWallFunction;
        value           uniform 1e-8;
    }
    east
    {
        type            omegaWallFunction;
        value           uniform 1e-8;
    }
    ovest
    {
        type            omegaWallFunction;
        value           uniform 1e-2;
    }
    south
    {
        type            omegaWallFunction;
        value           uniform 1e-8;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
