tutorials/melting/conduction/3D_cylinder_stationary/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5120;
        startFace       355630;
    }
    side
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3010;
        startFace       360750;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3010;
        startFace       363760;
    }
)

// ************************************************************************* //
