tutorials/melting/conduction/3D_cylinder_stationary/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              [0 2 -1 0 0 0 0] 1.69301e-6;

// Thermal expansion coefficient
beta            [0 0 0 -1 0 0 0] 2.1e-4; //2.67e-4;

// Reference temperature
TRef            [0 0 0 1 0 0 0] 900;

// Laminar Prandtl number
Pr              [0 0 0 0 0 0 0] 5.08;

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 0.85;

// ************************************************************************* //
