tutorials/melting/conduction/3D_cylinder_stationary/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.01;

        smoother         DICGaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|T|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|T|h|k|epsilon|omega)Final"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
}

/*
relaxationFactors
{
    fields
    {
        T               0.99;
        U               0.7;
        p_rgh           0.3;
        p               0.3;
    }

    equations
    {
        U               0.3;
        h               0.3;
        "(k|epsilon|omega)" 0.7;
    }
}
*/

/*        T
        {
            relTol          1e-4;
            tolerance       1e-4;
        }
        f
        {
            relTol          1e-4;
            tolerance       1e-4;
        }
*/




// ************************************************************************* //
